#+TITLE: Language and Voice Laboratory Computing Resources

* Installing software
  An easy way for a user to install necessary tools and libraries, other than
  compiling things yourself, is to use the Conda package manager.

  To use it you first have to add it to your environment:

  #+begin_src shell
  source /data/tools/anaconda/etc/profile.d/conda.sh
  #+end_src

  Then, to always have conda available you can add it to your bash profile with:

  #+begin_src shell
  conda init
  #+end_src

  Let's say that for some reason you need to use =pdftotext= from
  =poppler-utils=, then you can create and environment specifically for that:
  #+begin_src shell
  conda create -n pdf-stuff poppler-utils
  #+end_src

  This will create an environment named =pdf-stuff= with the package
  =poppler-utils= and all of its dependencies installed. To activate it you run:
  #+begin_src shell
  conda activate pdf-stuff
  #+end_src

  To verify that it has been loaded:
  #+begin_src shell :eval never-export :exports both
  whereis pdftotext
  #+end_src

  #+RESULTS:
  #+begin_example
  pdftotext: /home/staff/rkjaran/.conda/envs/test-poppler-env/bin/pdftotext
  #+end_example
  
